console.log(`вёрстка валидная +10 
<header>, <main>, <footer> +2'
шесть элементов <section> +2
только один заголовок <h1> +2
пять заголовков <h2> +2
один элемент <nav> +2
два списка ul > li > a +2
десять кнопок <button> +2
два инпута: <input type="email"> и <input type="tel"> +2
один элемент <textarea> +2
три атрибута placeholder +2
блок <header> +6
секция hero +6
секция skills +6
секция portfolio +6
секция video +6
секция price +6
секция contacts +6
блок <footer> +6
для построения сетки используются флексы или гриды +2
при уменьшении масштаба страницы браузера вёрстка размещается по центру +2
фоновый цвет тянется на всю ширину страницы +2
иконки добавлены в формате .svg. +2
изображения добавлены в формате .jpg +2
есть favicon +2
плавная прокрутка по якорям +5
ссылки в футере ведут на гитхаб автора проекта и на страницу курса +5
интерактивность +5
плавное изменение внешнего вида элемента при наведении +5
Total score: 110/110`)